package day04;

public class Test02 {
/*
 * 	반복문
 * 		특정 명령을 반복하도록 하는 명령
 * 	
 * 		종류]
 * 			1. for 명령
 * 				: 명령문 형식 자체에 카운터변수 ( 반복할 횟수를 지정하는 변수)가 만들어진다.
 * 
 * 			2. while명령
 * 				: 형식에 카운터변수 정의부분이 없다.
 * 					따라서 반복문아 실행되기전에 카운터 변수가 만들어져야 한다.
 * 					또는 반복실행을 종료할 조건을 반드시 추가 해줘야 한다. 	
 * 
 * 
 * 		1. for 명령
 * 			형식]
 * 
 * 
 */
	
	/*
	 *  구구단 9단 출력
	 */
	public static void main(String[] args) {
		
		
		/*
		 * for(int i=0; i<9; i++) { System.out.println("9 x " + (i+1) + " = " +
		 * (9*(i+1))); }
		 * 
		 */
		
	}

}
